package ch5;

public class MethodTest {

	// 얘가 메인 클래스임
	public static void main(String[] args) {
	

	}

	
	
	// 메소드를 하나 만들죠
	// 메소드를 만든다는 소리는 조건이 있다는 소리다.
	// 애초에 프로그래밍이라는 것은 다 조건이 있어요.
	// 어떻게 만들어주세요~~~ 하는게 다 조건이다.
	
	// << 시나리오 >>
	// '날씨 판독기능'을 구현해달라는 고객의 요청
	// 고객 : 온도가 23도 이하면 '춥다'라고 표시해주시구요.
	// 고객 : 온도가 30도 이상이면 '덥다'라고 표시해주세요.
	// 고객 : 그 외는 '좋다'라고 해주시면 될 것 같아요.
	//
	// 여기서 우리는 이 기능을 구현하기 위해 메소드를 만들겁니다.
	// 조건을 살펴보죠.. '온도'가 보여요. 그리고 결과값은 '춥다', '덥다', 그리고 '좋다'로 나타납니다.
	// 이제 구현을 해볼까요?
	
	// 결과적으로 우리는 메인에서 해야할 일과, 메소드가 해야할 일을 구분해주어야 합니다.
	// 메인에서는 온도값을 입력을 해주고, 결과값을 받아 출력해주면 됩니다.
	// '온도'는 23.5도같이 실수형이니까, double temp라고 하면 될 것 같네요.
	// 결과값은 String으로 반환하면 될 것 같아요.
	
	int student() {
		
		
		
		return;		
	}


}
